- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["dev"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["dev"].data.archive_file.processing_lambda_source: Read complete after 1s [id=e97e2572b977e70f9f644d74fc675a02e5408e71]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=e97e2572b977e70f9f644d74fc675a02e5408e71]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.mysql_backup_upload_user_policy will be created
  + resource "aws_iam_policy" "mysql_backup_upload_user_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-db-backup-db-backup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.mysql_backup_upload_user will be created
  + resource "aws_iam_user" "mysql_backup_upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bata-media-db-backup-db-backup-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.mysql_backup_user_attachment will be created
  + resource "aws_iam_user_policy_attachment" "mysql_backup_user_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bata-media-db-backup-db-backup-user"
    }

  # aws_s3_bucket.mysql_backup_bucket will be created
  + resource "aws_s3_bucket" "mysql_backup_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bata-media-db-backup"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.mysql_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "mysql_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-db-backup"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle" {
      + bucket                                 = "bata-media-db-backup"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "db-backup-lifecycle-rule"
          + prefix = (known after apply)
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 1
            }

          + noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
              + noncurrent_days           = 31
            }
        }
    }

  # aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl will be created
  + resource "aws_s3_bucket_public_access_block" "mysql_s3_bucket_public_acl" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bata-media-db-backup"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "frontend_allow_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.frontend_bucket["dev"].aws_cloudfront_distribution.frontend_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "frontend_cloudfront_distribution" {
      + aliases                         = [
          + "dev.fotos.batavierenrace.nl",
          + "www.dev.fotos.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-frontend-dev"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 60
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "origin1"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/85a04c7d-efec-4f18-ad2c-f16f9edb27de"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.frontend_bucket["dev"].aws_cloudfront_origin_access_identity.frontend_oai will be created
  + resource "aws_cloudfront_origin_access_identity" "frontend_oai" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "CloudFront identity for bata-media-frontend-dev"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.frontend_bucket["dev"].aws_iam_policy.upload_user_policy will be created
  + resource "aws_iam_policy" "upload_user_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-frontend-dev-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.frontend_bucket["dev"].aws_iam_user.upload_user will be created
  + resource "aws_iam_user" "upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bata-media-frontend-dev-upload-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.frontend_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment will be created
  + resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bata-media-frontend-dev-upload-user"
    }

  # module.frontend_bucket["dev"].aws_s3_bucket.frontend_s3_bucket will be created
  + resource "aws_s3_bucket" "frontend_s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bata-media-frontend-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_acl.frontend_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "frontend_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-frontend-dev"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_policy.frontend_s3_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "frontend_s3_bucket_policy" {
      + bucket = "bata-media-frontend-dev"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl will be created
  + resource "aws_s3_bucket_public_access_block" "frontend_s3_bucket_public_acl" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bata-media-frontend-dev"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "frontend_s3_bucket_website_configuration" {
      + bucket           = "bata-media-frontend-dev"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = "404"
            }
          + redirect {
              + host_name               = "dev.fotos.batavierenrace.nl"
              + replace_key_prefix_with = "#!/"
            }
        }
    }

  # module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "frontend_allow_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "frontend_cloudfront_distribution" {
      + aliases                         = [
          + "fotos.batavierenrace.nl",
          + "www.fotos.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-frontend-prod"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 60
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "origin1"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/9000e290-e8b6-448c-a1e6-6da09a58ee2b"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai will be created
  + resource "aws_cloudfront_origin_access_identity" "frontend_oai" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "CloudFront identity for bata-media-frontend-prod"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy will be created
  + resource "aws_iam_policy" "upload_user_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-frontend-prod-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_user.upload_user will be created
  + resource "aws_iam_user" "upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bata-media-frontend-prod-upload-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment will be created
  + resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bata-media-frontend-prod-upload-user"
    }

  # module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket will be created
  + resource "aws_s3_bucket" "frontend_s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bata-media-frontend-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "frontend_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-frontend-prod"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "frontend_s3_bucket_policy" {
      + bucket = "bata-media-frontend-prod"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl will be created
  + resource "aws_s3_bucket_public_access_block" "frontend_s3_bucket_public_acl" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bata-media-frontend-prod"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "frontend_s3_bucket_website_configuration" {
      + bucket           = "bata-media-frontend-prod"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = "404"
            }
          + redirect {
              + host_name               = "fotos.batavierenrace.nl"
              + replace_key_prefix_with = "#!/"
            }
        }
    }

  # module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "photo_allow_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.photo_bucket["dev"].aws_cloudfront_distribution.photo_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "photo_cloudfront_distribution" {
      + aliases                         = [
          + "photos.dev.fotos.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-photo-dev"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "origin1"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/85a04c7d-efec-4f18-ad2c-f16f9edb27de"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.photo_bucket["dev"].aws_cloudfront_origin_access_identity.photo_oai will be created
  + resource "aws_cloudfront_origin_access_identity" "photo_oai" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "CloudFront identity for bata-media-photo-dev"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.photo_bucket["dev"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "photo_cloudfront_response_headers_policy" {
      + arn     = (known after apply)
      + comment = "Policy to ensure CORS headers are always passed on photos, even if they're cached without."
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "MediaCorsResponseHeadersPolicy-dev"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 600
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Authorization",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "GET",
                  + "POST",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "http://localhost",
                  + "http://localhost:3000",
                  + "https://dev.fotos.batavierenrace.nl",
                  + "https://www.dev.fotos.batavierenrace.nl",
                ]
            }
        }
    }

  # module.photo_bucket["dev"].aws_iam_policy.upload_user_policy will be created
  + resource "aws_iam_policy" "upload_user_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-photo-dev-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.photo_bucket["dev"].aws_iam_user.upload_user will be created
  + resource "aws_iam_user" "upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bata-media-photo-dev-upload-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.photo_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment will be created
  + resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bata-media-photo-dev-upload-user"
    }

  # module.photo_bucket["dev"].aws_s3_bucket.photo_s3_bucket will be created
  + resource "aws_s3_bucket" "photo_s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bata-media-photo-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.photo_bucket["dev"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "photo_s3_bucket_cors" {
      + bucket = "bata-media-photo-dev"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "http://localhost",
              + "http://localhost:3000",
              + "https://dev.fotos.batavierenrace.nl",
              + "https://www.dev.fotos.batavierenrace.nl",
            ]
          + expose_headers  = []
            id              = null
        }
    }

  # module.photo_bucket["dev"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "photo_s3_bucket_lifecycle" {
      + bucket                                 = "bata-media-photo-dev"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "photo-lifecycle-rule"
          + prefix = (known after apply)
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 1
            }

          + noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
              + noncurrent_days           = 31
            }
        }
    }

  # module.photo_bucket["dev"].aws_s3_bucket_policy.photo_s3_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "photo_s3_bucket_policy" {
      + bucket = "bata-media-photo-dev"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.photo_bucket["dev"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl will be created
  + resource "aws_s3_bucket_public_access_block" "photo_s3_bucket_public_acl" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bata-media-photo-dev"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.photo_bucket["dev"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "photo_s3_bucket_website_configuration" {
      + bucket           = "bata-media-photo-dev"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "photo_allow_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "photo_cloudfront_distribution" {
      + aliases                         = [
          + "photos.fotos.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-photo-prod"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "origin1"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/9000e290-e8b6-448c-a1e6-6da09a58ee2b"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai will be created
  + resource "aws_cloudfront_origin_access_identity" "photo_oai" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "CloudFront identity for bata-media-photo-prod"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "photo_cloudfront_response_headers_policy" {
      + arn     = (known after apply)
      + comment = "Policy to ensure CORS headers are always passed on photos, even if they're cached without."
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "MediaCorsResponseHeadersPolicy-prod"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 600
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Authorization",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "GET",
                  + "POST",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://fotos.batavierenrace.nl",
                  + "https://www.fotos.batavierenrace.nl",
                ]
            }
        }
    }

  # module.photo_bucket["prod"].aws_iam_policy.upload_user_policy will be created
  + resource "aws_iam_policy" "upload_user_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-photo-prod-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.photo_bucket["prod"].aws_iam_user.upload_user will be created
  + resource "aws_iam_user" "upload_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bata-media-photo-prod-upload-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment will be created
  + resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bata-media-photo-prod-upload-user"
    }

  # module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket will be created
  + resource "aws_s3_bucket" "photo_s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bata-media-photo-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "photo_s3_bucket_cors" {
      + bucket = "bata-media-photo-prod"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://fotos.batavierenrace.nl",
              + "https://www.fotos.batavierenrace.nl",
            ]
          + expose_headers  = []
            id              = null
        }
    }

  # module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "photo_s3_bucket_lifecycle" {
      + bucket                                 = "bata-media-photo-prod"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "photo-lifecycle-rule"
          + prefix = (known after apply)
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 1
            }

          + noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
              + noncurrent_days           = 31
            }
        }
    }

  # module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "photo_s3_bucket_policy" {
      + bucket = "bata-media-photo-prod"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl will be created
  + resource "aws_s3_bucket_public_access_block" "photo_s3_bucket_public_acl" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bata-media-photo-prod"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "photo_s3_bucket_website_configuration" {
      + bucket           = "bata-media-photo-prod"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-role-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::bata-media-photo-dev/*",
            ]
        }
    }

  # module.processing_queue["dev"].aws_iam_policy.lambda-role-policy will be created
  + resource "aws_iam_policy" "lambda-role-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "media-photo-processing-dev-processing-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.processing_queue["dev"].aws_iam_role.lambda-execution-role will be created
  + resource "aws_iam_role" "lambda-execution-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "media-photo-processing-dev-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.processing_queue["dev"].aws_iam_role_policy_attachment.lambda-execution-role-policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda-execution-role-policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.processing_queue["dev"].aws_lambda_event_source_mapping.processing_lambda_event_mapping will be created
  + resource "aws_lambda_event_source_mapping" "processing_lambda_event_mapping" {
      + arn                           = (known after apply)
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.processing_queue["dev"].aws_lambda_function.processing_lambda will be created
  + resource "aws_lambda_function" "processing_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/photo-processing/artifacts/lambda_source.zip"
      + function_name                  = "photo-processing-lambda-dev"
      + handler                        = "index.process"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:eu-west-1:770693421928:layer:Klayers-p312-Pillow:3",
        ]
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ME91qafoh8I14MekiS15oryIh1xqEU4vlj8Wth7Z+zQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue will be created
  + resource "aws_sqs_queue" "photo-processing-queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "media-photo-processing-dev"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue-dlq will be created
  + resource "aws_sqs_queue" "photo-processing-queue-dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "media-photo-processing-dev-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-role-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::bata-media-photo-prod/*",
            ]
        }
    }

  # module.processing_queue["prod"].aws_iam_policy.lambda-role-policy will be created
  + resource "aws_iam_policy" "lambda-role-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "media-photo-processing-prod-processing-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.processing_queue["prod"].aws_iam_role.lambda-execution-role will be created
  + resource "aws_iam_role" "lambda-execution-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "media-photo-processing-prod-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda-execution-role-policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping will be created
  + resource "aws_lambda_event_source_mapping" "processing_lambda_event_mapping" {
      + arn                           = (known after apply)
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be created
  + resource "aws_lambda_function" "processing_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/photo-processing/artifacts/lambda_source.zip"
      + function_name                  = "photo-processing-lambda-prod"
      + handler                        = "index.process"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:eu-west-1:770693421928:layer:Klayers-p312-Pillow:3",
        ]
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ME91qafoh8I14MekiS15oryIh1xqEU4vlj8Wth7Z+zQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue will be created
  + resource "aws_sqs_queue" "photo-processing-queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "media-photo-processing-prod"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq will be created
  + resource "aws_sqs_queue" "photo-processing-queue-dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "media-photo-processing-prod-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 65 to add, 0 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 19, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  19:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*